In [9]:
#=指派新的欄位
import pandas as pd
df=pd.DataFrame([[1],[2]],columns=['a']) 
print(df)

   a
0  1
1  2

In [4]:
df['b']=pd.Series([3,4])
print(df)

   a  b
0  1  3
1  2  4

In [5]:
import pandas as pd

df=pd.DataFrame([[1,2]],columns=['a','b'])
print(df)

   a  b
0  1  2

In [6]:
#append() 新增列
df=df.append(pd.DataFrame([[3,4]],columns=['a','b']))
print(df)

   a  b
0  1  2
0  3  4

In [10]:
df=df.append(pd.DataFrame([[3,4]],columns=['a','b']))
df=df.reset_index(drop=True)
print(df)

   a    b
0  1  NaN
1  2  NaN
2  3  4.0

In [14]:
import pandas as pd
df=pd.DataFrame([[1,2,3]],columns=['a','b','c'])
print(df)

   a  b  c
0  1  2  3

In [15]:
del df['a']
df

   b  c
0  2  3

In [16]:
df.pop('c')

0    3
Name: c, dtype: int64

In [17]:
df=pd.DataFrame([[1],[2]],columns=['a'])
print(df)

   a
0  1
1  2

In [18]:
df=df.drop(1)
print(df)

   a
0  1

In [20]:
one=pd.DataFrame({
    'id':[1,2],
    'Name':['AAA','BBB']
})
two=pd.DataFrame({
    'id':[1,2],
    'Name':['CCC','DDD']
})

pd.concat([one,two])#連集上下

   id Name
0   1  AAA
1   2  BBB
0   1  CCC
1   2  DDD

In [21]:
pd.merge(one,two,on='id')#合併左右

   id Name_x Name_y
0   1    AAA    CCC
1   2    BBB    DDD

In [23]:
one=pd.DataFrame({
    'Name':['aaa','bbb']
})
two=pd.DataFrame({
    'Score':[11,22]
})

one.join(two)

  Name  Score
0  aaa     11
1  bbb     22

In [24]:
df=pd.DataFrame({
    'A':['aa','bb','aa','bb'],
    'B':['one','one','two','three'],
    'C':[1,2,3,4],
    'D':[10,20,30,40]
})
df

    A      B  C   D
0  aa    one  1  10
1  bb    one  2  20
2  aa    two  3  30
3  bb  three  4  40

In [26]:
df.groupby('A').sum()

    C   D
A
aa  4  40
bb  6  60

In [28]:
df.groupby('A').agg(sum)

    C   D
A
aa  4  40
bb  6  60

In [29]:
df.groupby(['A','B']).sum()

          C   D
A  B
aa one    1  10
   two    3  30
bb one    2  20
   three  4  40